
# -------------------------------------------------------------------------------------------------------------------
# 1) Создать 2 переменных типа String с разными значениями
# string_S1 = "строкаОдин"
# string_S2 = "строкаДва"

# -------------------------------------------------------------------------------------------------------------------
# 2) Создать 4 переменных типа Integer с разными значениями
# int_1 = 2
# int_2 = 3
# int_3 = 4
# int_4 = 5

# -------------------------------------------------------------------------------------------------------------------
# 3) Создать 3 переменных типа Float с разными значениями
# float_1 = 1.2345
# float_2 = 1.6789
# float_3 = 1.0123

# -------------------------------------------------------------------------------------------------------------------
# 4) Реализовать 15 варианта сравнения int переменных с операторами >, <, >=, <=, !=. Pезультаты весвести в консоль.
    # 4.1-----------------------------------------------------------------------------------------------------------
# print("# 4.1----------------------------------------------------------------------------------------------------")
# if (int_1 > int_2):
#     print("int_1 = ", int_1, " and it's more than int_2, = ", int_2)
# else:
#     print("int_1 = ", int_1, " and it's not more than int_2, = ", int_2)
#     # 4.2-----------------------------------------------------------------------------------------------------------
# print("# 4.2----------------------------------------------------------------------------------------------------")
# if (int_1 >= int_2):
#     print("int_1 = ", int_1, " and it's more or equal int_2, = ", int_2)
# else:
#     print("int_1 = ", int_1, " and it's not more than int_2, = ", int_2)
#     # 4.3-----------------------------------------------------------------------------------------------------------
# print("# 4.3----------------------------------------------------------------------------------------------------")
# if (int_1 < int_3):
#     print("int_1 = ", int_1, " and it's less than int_3, = ", int_3)
# else:
#     print("int_1 = ", int_1, " and it's more than int_3, = ", int_3)
#     # 4.4-----------------------------------------------------------------------------------------------------------
# print("# 4.4----------------------------------------------------------------------------------------------------")
# if (int_1 >= int_3):
#     print("int_1 = ", int_1, " and it's more or equal than int_3 = ", int_3)
# else:
#     print("int_1 = ", int_1, " and it's less than int_3 = ", int_3)
#     # 4.5-----------------------------------------------------------------------------------------------------------
# print("# 4.5----------------------------------------------------------------------------------------------------")
# if (int_1 != int_4):
#     print("int_1 = ", int_1, " and it's not equal int_4 = ", int_4)
# else:
#     print("int_1 = ", int_1, " it's equal than int_4 = ", int_4)
#     # 4.6-----------------------------------------------------------------------------------------------------------
# print("# 4.6----------------------------------------------------------------------------------------------------")
# if (int_1 >= int_4):
#     print("int_1 = ", int_1, " and it's more or equal than int_4 = ", int_4)
# else:
#     print("int_1 = ", int_1, " and it's not more than int_4 = ", int_4)
#     # 4.7-----------------------------------------------------------------------------------------------------------
# print("# 4.7----------------------------------------------------------------------------------------------------")
# if (int_1 >= int_4):
#         print("int_1 = ", int_1, " and it's more or equal than int_4 = ", int_4)
# else:
#         print("int_1 = ", int_1, " and it's not more than int_4 = ", int_4)
#     # 4.8-----------------------------------------------------------------------------------------------------------
# print("# 4.8----------------------------------------------------------------------------------------------------")
# if (int_2 <= int_3):
#     print("int_1 = ", int_1, " and it's less or equal than int_3 = ", int_3)
# else:
#     print("int_1 = ", int_1, " and it's more than int_4 = ", int_4)
#     # 4.9-----------------------------------------------------------------------------------------------------------
# print("# 4.9----------------------------------------------------------------------------------------------------")
# if (int_2 <= int_3):
#     print("int_2 = ", int_2, " and it's less or equal than int_3 = ", int_3)
# else:
#     print("int_2 = ", int_2, " and it's more than int_3 = ", int_3)
#     # 4.10-----------------------------------------------------------------------------------------------------------
# print("# 4.10----------------------------------------------------------------------------------------------------")
# if (int_2 > int_3):
#     print("int_2 = ", int_2, " and it's more than int_3 = ", int_3)
# else:
#     print("int_2 = ", int_2, " and it's less than int_3 = ", int_3)
#     # 4.11-----------------------------------------------------------------------------------------------------------
# print("# 4.11----------------------------------------------------------------------------------------------------")
# if (int_2 != int_4):
#     print("int_2 = ", int_2, " and it's not equal than int_4 = ", int_4)
# elif (int_2 < int_4):
#     print("int_2 = ", int_2, " and it's less than int_4 = ", int_4)
# else:
#     print("int_2 = ", int_2, " and it's more than int_4 = ", int_4)
#     # 4.12-----------------------------------------------------------------------------------------------------------
# print("# 4.12----------------------------------------------------------------------------------------------------")
# if (int_3 >= int_4):
#     print("int_3 = ", int_3, " and it's more than int_4 = ", int_4)
# else:
#     print("int_3 = ", int_3, " and it's more than int_4 = ", int_4)
#     # 4.13-----------------------------------------------------------------------------------------------------------
# print("# 4.13----------------------------------------------------------------------------------------------------")
# if (int_4 >= int_2):
#     print("int_4 = ", int_4, " and it's more or equal than int_2 = ", int_2)
# else:
#     print("int_4 = ", int_4, " and it's less than int_2 = ", int_2)
#     # 4.14-----------------------------------------------------------------------------------------------------------
# print("# 4.14----------------------------------------------------------------------------------------------------")
# if (int_4 != int_1):
#     print("int_4 = ", int_4, " and it's not equal than int_1 = ", int_1)
# elif (int_4 > int_1):
#     print("int_4 = ", int_4, " and it's more than int_1 = ", int_1)
# else:
#     print("int_4 = ", int_4, " and it's not more than int_1 = ", int_1)
#     # 4.15-----------------------------------------------------------------------------------------------------------
# print("# 4.15----------------------------------------------------------------------------------------------------")
# if (int_4 != int_2):
#     print("int_4 = ", int_4, " and it's not equal than int_2 = ", int_2)
# elif (int_4 > int_2):
#     print("int_4 = ", int_4, " and it's more than int_2 = ", int_2)
# else:
#     print("int_4 = ", int_4, " and it's not more than int_2 = ", int_2)

# -------------------------------------------------------------------------------------------------------------------
# 5) Реализовать 9 варианта сравнения Float переменных с операторами >, <, >=, <=, !=. Pезультаты весвести в консоль

# 5.1-----------------------------------------------------------------------------------------------------------
print("# 5.1----------------------------------------------------------------------------------------------------")
# if (float_1 >= float_2):
#     print("float_1 = ", float_1, " and it's more or equal than float_2 = ", float_2)
# else:
#     print("float_2 = ", float_1, " and it's less than float_2 = ", float_2)
# print("# 5.2----------------------------------------------------------------------------------------------------")
# # 5.2-----------------------------------------------------------------------------------------------------------
# if (float_2 >= float_3):
#     print("float_1 = ", float_2, " and it's more or equal than float_3 = ", float_3)
# else:
#     print("float_2 = ", float_2, " and it's less than float_3 = ", float_3)
# print("# 5.3----------------------------------------------------------------------------------------------------")
# # 5.3-----------------------------------------------------------------------------------------------------------
# if (float_1 >= float_3):
#     print("float_1 = ", float_2, " and it's more or equal than float_3 = ", float_3)
# else:
#     print("float_1 = ", float_2, " and it's less than float_3 = ", float_3)
# print("# 5.4----------------------------------------------------------------------------------------------------")
# # 5.4-----------------------------------------------------------------------------------------------------------
# if (float_2 != float_1):
#     print("float_2 = ", float_2, " and it's not equal than float_1 = ", float_1)
# elif (float_2 > float_1):
#     print("float_2 = ", float_2, " and it's more than float_1 = ", float_1)
# else:
#     print("float_2 = ", float_2, " and it's not more than float_1 = ", float_1)
# print("# 5.5----------------------------------------------------------------------------------------------------")
# # 5.5-----------------------------------------------------------------------------------------------------------
# if (float_2 < float_1):
#     print("float_2 = ", float_2, " and it's less than float_1 = ", float_1)
# else:
#     print("float_2 = ", float_2, " and it's more than float_1 = ", float_1)
# print("# 5.6----------------------------------------------------------------------------------------------------")
# # 5.6-----------------------------------------------------------------------------------------------------------
# if (float_2 <= float_1):
#     print("float_2 = ", float_2, " and it's less or equal than float_1 = ", float_1)
# else:
#     print("float_2 = ", float_2, " and it's more than float_1 = ", float_1)
# print("# 5.7----------------------------------------------------------------------------------------------------")
# # 5.7-----------------------------------------------------------------------------------------------------------
# if (float_2 >= float_3):
#     print("float_2 = ", float_2, " and it's more or equal than float_3 = ", float_3)
# else:
#     print("float_2 = ", float_2, " and it's less than float_3 = ", float_3)
# print("# 5.8----------------------------------------------------------------------------------------------------")
# # 5.8-----------------------------------------------------------------------------------------------------------
# if (float_1 >= float_3):
#     print("float_1 = ", float_1, " and it's more or equal than float_3 = ", float_3)
# else:
#     print("float_1 = ", float_1, " and it's less than float_3 = ", float_3)
# print("# 5.9----------------------------------------------------------------------------------------------------")
# if (float_2 != float_3):
#     print("float_2 = ", float_2, " and it's not equal than float_3 = ", float_3)
# elif (float_2 > float_3):
#     print("float_2 = ", float_2, " and it's more than float_3 = ", float_3)
# else:
#     print("float_2 = ", float_2, " and it's not more than float_3 = ", float_3)
# -------------------------------------------------------------------------------------------------------------------
# 6) Реализовать 10 варианта сравнения int переменных с операторами >, <, >=, <=, != и условными выражениями (end, or, not).
# Pезультаты весвести в консоль.
# print("# 6.1----------------------------------------------------------------------------------------------------")
# if (int_1 > int_2 and int_1 < int_3):
#     print("int_1 > int_2 and int_1 < int_3")
# else:
#     print("FAIL")
# print("# 6.2----------------------------------------------------------------------------------------------------")
# if (int_2 > int_3 or int_2 < int_4):
#     print("int_2 > int_3 or int_2 < int_4")
# else:
#     print("FAIL")
# print("# 6.3----------------------------------------------------------------------------------------------------")
# if (int_3 > int_1 or int_3 >= int_2):
#     print("int_3 > int_1 and int_3 = int_2")
# else:
#     print("FAIL")
# print("# 6.4----------------------------------------------------------------------------------------------------")
# if (int_2 < int_1 and not int_1 >= int_3):
#     print("int_2 < int_1 and int_1 >= int_3")
# else:
#     print("FAIL")
# print("# 6.5----------------------------------------------------------------------------------------------------")
# if (int_4 < int_1 or int_2 >= int_3):
#     print("int_4 < int_1 or int_2 >= int_3")
# else:
#     print("FAIL")
# print("# 6.6----------------------------------------------------------------------------------------------------")
# if (int_4 != int_1 and int_2 >= int_3):
#     print("int_4 != int_1 and int_2 >= int_3")
# else:
#     print("FAIL")
# print("# 6.6----------------------------------------------------------------------------------------------------")
# if (int_4 != int_1 and int_2 >= int_3):
#     print("int_4 != int_1 and int_2 >= int_3")
# else:
#     print("FAIL")
# print("# 6.7----------------------------------------------------------------------------------------------------")
# if (int_1 != int_2 and int_3 >= int_4):
#     print("int_1 != int_2 and int_3 >= int_4")
# else:
#     print("FAIL")
# print("# 6.8----------------------------------------------------------------------------------------------------")
# if (int_4 != int_2 and not int_1 < int_4):
#     print("int_4 != int_2 and not int_1 < int_4")
# else:
#     print("FAIL")
# print("# 6.9----------------------------------------------------------------------------------------------------")
# if (int_2 != int_1 or int_1 <= int_3):
#     print("int_4 != int_2 and not int_1 < int_4")
# else:
#     print("FAIL")
# print("# 6.10----------------------------------------------------------------------------------------------------")
# if (int_2 > int_4 or int_1 != int_3):
#     print("int_2 > int_4 or int_1 != int_3")
# else:
#     print("FAIL")
# _______________________________________________________________________________________________________________________
# 7) Сделать скрипт используя функцию input().
# #     1. Функция должна на вход принимать целое число.
# #     2. Выводить должна "Вы вели число = (введённое число) которое (меньше/больше/равно) 30"


# input_data = int(input('enter your number:'))
# if (input_data < 30):
#     print('Число меньше 30')
# elif (input_data == 30):
#     print('Число равно 30')
# else:
#     print('Число больше 30')
# _______________________________________________________________________________________________________________________
# 8 😍 Сделать скрипт используя функцию input().
#     1. Функция должна на вход принимать целое число.
#     2. Внутри функции должно сгенерироваться рандомное целое число (import random)...(random.randint(1, 100))
#     3. Выводить должна "Вы вели число = (введённое число) которое (меньше/больше/равно) сгенерированному числу"
# import random

# def get_money():
#     input_data = int(input('Enter figure:'))
#     return input_data
# def funct():
#     input_data = get_money()
#
#     da = random.randint(1,100)
#     if input_data < da:
#         print("Вы ввели число", input_data,  "которое меньше сгенерированного числа - ", da)
#     elif input_data == da:
#         print("Вы ввели число", input_data,  "которое равно сгенерированному числу - ", da)
#     else:
#         print("Вы ввели число", input_data, "которое больше сгенерированного числа - ", da)
# funct()
# ------------------------------------------------------------------------------------------------------------------------
# 9) Сделать скрипт используя функцию input().
#     1. Функция должна на вход принимать целое число.
#     2. Внутри функции должно сгенерироваться рандомное 2 целых числа (import random)...(random.randint(1, 100))
#     3. Выводить должна "Вы вели число = (введённое число) которое (меньше/больше/равно и меньше/больше/равно) сгенерированному числу
# import random

def get_money():
    input_data = int(input('Enter figure:'))
    return input_data
def funct():
    input_data = get_money()
    da = (random.randint(1,100))
    ds = (random.randint(1, 100))
    if input_data < da and input_data < ds:
        print("Вы ввели число", input_data,  "которое меньше сгенерированного числа 1 =", da, "и 2 = ", ds)
    elif input_data == da and input_data == ds:
        print("Вы ввели число", input_data,  "которое равно сгенерированным числам 1 =", da, "и 2 = ", ds)
    elif input_data > da and input_data > ds:
        print("Вы ввели число", input_data, "которое больше сгенерированного числа 1 =", da, "и 2 = ", ds)
    elif input_data < da and input_data > ds:
        print("Вы ввели число", input_data, "которое меньше сгенерированного числа 1 = ", da, "но больше числа 2 =", ds)
    else:
        print("Вы ввели число", input_data, "которое больше сгенерированного числа 1 = ", da, "но меньше числа 2 =", ds)
funct()